_src/wiki/2016-08-25-用K-均值聚类给女明星们的身材分分类.org
#+title: 用K-均值聚类给女明星们的身材分分类
#+date: <2016-08-25 20:48>
#+filetags: reprint
#+options: ^:{}

* 选题简介：
做这个题目颇有哗众取宠之嫌，本来是想能否用数据挖掘来分析星座之间的关系的，但是找
了一些数据，发现关于星座的内容都是文字描述型的，实在不知道该怎么用定量方法来分析。
然后想着想着，发现女明星的身材，比如体重，身高，三围，这些都是可以量化的数据，然
后就决定了这个选题了。而关于挖掘方法的选取上，由于选题的原因，肯定是要使用聚类方
法，之所以选择k-均值聚类方法，主要是由于它简单一些，编程好实现（真正写代码的时候，
我才发现这是个坑，整整写了两天才写完了）。    数据来源：        主要是通过搜索引
擎找到的，有两个帖子，里面提供了几十个女明星的三围以及身高体重数据。再通过百度百
科，基本上就找到了我要的数据了。全部总共找到了67个女明星的身材数据，中外都有。但
是感觉可靠性很值得怀疑（毕竟国内的女明星很少会公布三围，即使公布了，也有造假之
嫌）。由于只是实验性质的，因此数据的可信度并不需要考虑。


** 数据存储格式：

由于数据量较少，就简单的使用了文本文件的形式存储，大致格式如下，身高的单位是CM，
体重的单位是磅，三围的单位是英寸。

| 姓名   | 身高 |  体重 | 胸围 | 腰围 | 臀围 |
|--------+------+-------+------+------+------|
| 金巧巧 |  164 | 112.5 |   34 |   25 |   34 |
| 杨幂   |  168 |    99 |   32 |   24 |   32 |
| 钟丽缇 |  168 |   108 |   36 |   24 |   35 |
| 朱茵   |  160 |    95 |   33 |   22 |   33 |
| 赵薇   |  166 |   105 |   33 |   23 |   33 |
| 李珊珊 |  175 |   115 |   36 |   24 |   36 |
| 佘诗曼 |  164 |    96 |   33 |   22 |   34 |
| 郭羡妮 |  166 |   103 |   33 |   23 |   34 |
| 郑秀文 |  165 |   100 |   31 |   22 |   32 |

