wiki/2016-08-25-用K-均值聚类给女明星们的身材分分类.html
<!DOCTYPE html>
<html lang="zh">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://bruceasu.github.io/rss.xml"
      title="RSS feed for https://bruceasu.github.io/"/>
<title>用K-均值聚类给女明星们的身材分分类</title>
<meta name="author" content="Bruce">
<meta name="referrer" content="no-referrer">
<link href= "/styles/org-manual.css" rel="stylesheet" type="text/css" />
<link rel="icon" href="static/favicon.ico">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta http-equiv="content-type" content="text/html; charset=utf-8" />
<link rel="stylesheet" href="/styles/font.css">
<link rel="stylesheet" media="screen and (min-width: 600px)" href="/styles/post.css">
<link rel="stylesheet" media="screen and (max-width: 600px)" href="/styles/post_mobile.css">
<link rel="stylesheet" media="screen and (min-width: 600px)" href="/styles/navigatebar.css">
<link rel="stylesheet" media="screen and (max-width: 600px)" href="/styles/navigatebar_mobile.css">
<link rel="stylesheet" href="/theme/highlight.css">

</head>
<body>
<div class="navigatebar">
    <div class="navigatebar-button navigatebar-mine">
        <a href="/index.html">Free World</a>
    </div>
    <div class="navigatebar-slogan">
        「生活可以更简单, 欢迎来到我的开源世界」
    </div>
    <div class="navigatebar-button">
        <a href="/index.html">Home</a>
    </div>
    <div class="navigatebar-button">
        <a href="/tags.html">Tags</a>
    </div>
    <div class="navigatebar-button">
        <a href="/rss.xml">Feeds</a>
    </div>
    <div class="navigatebar-button navigatebar-about">
        <a href="/about.html">About</a>
    </div>
</div>

      <div class="content-area">
<div class="title">用K-均值聚类给女明星们的身材分分类</div>
<div class="category-area"><a href="https://bruceasu.github.io/tags.html#reprint"><div class="category">reprint</div></a> </div>
<div class="char-counter">2016-08-25</div>
        <div id="content">
<nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgf033fcc">选题简介：</a>
<ul>
<li><a href="#org711256a">数据存储格式：</a></li>
<li><a href="#orge8b18df">开发工具介绍：</a></li>
</ul>
</li>
</ul>
</div>
</nav>

<div id="outline-container-orgf033fcc" class="outline-2">
<h2 id="orgf033fcc">选题简介：</h2>
<div class="outline-text-2" id="text-orgf033fcc">
<p>
做这个题目颇有哗众取宠之嫌，本来是想能否用数据挖掘来分析星座之间的关系的，但是找
了一些数据，发现关于星座的内容都是文字描述型的，实在不知道该怎么用定量方法来分析。
然后想着想着，发现女明星的身材，比如体重，身高，三围，这些都是可以量化的数据，然
后就决定了这个选题了。而关于挖掘方法的选取上，由于选题的原因，肯定是要使用聚类方
法，之所以选择k-均值聚类方法，主要是由于它简单一些，编程好实现（真正写代码的时候，
我才发现这是个坑，整整写了两天才写完了）。    数据来源：        主要是通过搜索引
擎找到的，有两个帖子，里面提供了几十个女明星的三围以及身高体重数据。再通过百度百
科，基本上就找到了我要的数据了。全部总共找到了67个女明星的身材数据，中外都有。但
是感觉可靠性很值得怀疑（毕竟国内的女明星很少会公布三围，即使公布了，也有造假之
嫌）。由于只是实验性质的，因此数据的可信度并不需要考虑。
</p>
</div>


<div id="outline-container-org711256a" class="outline-3">
<h3 id="org711256a">数据存储格式：</h3>
<div class="outline-text-3" id="text-org711256a">
<p>
由于数据量较少，就简单的使用了文本文件的形式存储，大致格式如下，身高的单位是CM，
体重的单位是磅，三围的单位是英寸。
</p>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">姓名</th>
<th scope="col" class="org-right">身高</th>
<th scope="col" class="org-right">体重</th>
<th scope="col" class="org-right">胸围</th>
<th scope="col" class="org-right">腰围</th>
<th scope="col" class="org-right">臀围</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">金巧巧</td>
<td class="org-right">164</td>
<td class="org-right">112.5</td>
<td class="org-right">34</td>
<td class="org-right">25</td>
<td class="org-right">34</td>
</tr>

<tr>
<td class="org-left">杨幂</td>
<td class="org-right">168</td>
<td class="org-right">99</td>
<td class="org-right">32</td>
<td class="org-right">24</td>
<td class="org-right">32</td>
</tr>

<tr>
<td class="org-left">钟丽缇</td>
<td class="org-right">168</td>
<td class="org-right">108</td>
<td class="org-right">36</td>
<td class="org-right">24</td>
<td class="org-right">35</td>
</tr>

<tr>
<td class="org-left">朱茵</td>
<td class="org-right">160</td>
<td class="org-right">95</td>
<td class="org-right">33</td>
<td class="org-right">22</td>
<td class="org-right">33</td>
</tr>

<tr>
<td class="org-left">赵薇</td>
<td class="org-right">166</td>
<td class="org-right">105</td>
<td class="org-right">33</td>
<td class="org-right">23</td>
<td class="org-right">33</td>
</tr>

<tr>
<td class="org-left">李珊珊</td>
<td class="org-right">175</td>
<td class="org-right">115</td>
<td class="org-right">36</td>
<td class="org-right">24</td>
<td class="org-right">36</td>
</tr>

<tr>
<td class="org-left">佘诗曼</td>
<td class="org-right">164</td>
<td class="org-right">96</td>
<td class="org-right">33</td>
<td class="org-right">22</td>
<td class="org-right">34</td>
</tr>

<tr>
<td class="org-left">郭羡妮</td>
<td class="org-right">166</td>
<td class="org-right">103</td>
<td class="org-right">33</td>
<td class="org-right">23</td>
<td class="org-right">34</td>
</tr>

<tr>
<td class="org-left">郑秀文</td>
<td class="org-right">165</td>
<td class="org-right">100</td>
<td class="org-right">31</td>
<td class="org-right">22</td>
<td class="org-right">32</td>
</tr>
</tbody>
</table>
</div>
</div>
